backend/modules/admin/views/promocode/index.php

        ]
    ]) ?>
    <div class="table-responsive">
        <?= GridView::widget([
            'dataProvider' => $dataProvider,
            'filterModel' => $searchModel,
            'columns' => [
                ['class' => 'yii\grid\SerialColumn'],

                'id',
                'promo',
                'percent',
                [
                    'label' => 'Транзакция',
                    'format' => 'html',
                    'value' => function (Promocode $model) {
                        if ($model->status == Promocode::STATUS_INACTIVE) {
                            $transaction = Transaction::findOne(['promocode_id' => $model->id, 'status' => Transaction::STATUS_PAID]);
                            if ($transaction)
                                return Html::a($transaction->id, ['/admin/transaction/view', 'id' => $transaction->id]);
                        }
                        return '';
                    },
                    'filter' => false,
                ],
---
SELECT * FROM `promocode` LIMIT 20
SELECT COUNT(*) FROM `promocode`
SELECT * FROM `transaction` WHERE (`promocode_id`=1) AND (`status`=2)