backend/views/layouts/_header.php

SELECT * FROM `user` WHERE `id` IS NULL
---
                <li class="user user-menu">
                    <a href="<?= Url::to(['site/logout']) ?>" data-method="post" class="dropdown-toggle"
                       data-toggle="dropdown" title="Выйти">
                        (<?= User::findOne(['id' => Yii::$app->user->id])->fullname ?>) <i class="fa fa-power-off"></i>