backend/modules/admin/views/purchased-course/index.php

SELECT * FROM `course` WHERE `id`=12
SELECT * FROM `course`
---
                    'value' => function (PurchasedCourse $model) {
                        return Html::a(strip_tags($model->course->title), ['/admin/course/view', 'id' => $model->course_id]);
                    },
                    'filter' => Select2::widget([
                        'attribute' => 'course_id',
                        'model' => $searchModel,
                        'data' => array_map(function ($v) {
                            return trim(strip_tags($v));
                        }, ArrayHelper::map(Course::find()->all(), 'id', 'title')),
                        'value' => 'name',
                        'options' => [
                            'class' => 'form-control',
                            'placeholder' => 'Выберите курс'
                        ],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'selectOnClose' => true,
                        ]
                    ])