backend/modules/admin/controllers/AuthorController.php

SELECT * FROM `author` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Author::findOne($id)) !== null) {