backend/modules/admin/controllers/DefaultController.php

SELECT * FROM `statistic` ORDER BY `date`
---
    public function actionIndex()
    {
        $params = Yii::$app->request->queryParams;

        if (count($params) == 0) {
            $params = Yii::$app->session['statisticparams'];
            if (isset(Yii::$app->session['statisticparams']['page']))
                $_GET['page'] = Yii::$app->session['statisticparams']['page'];
        } else {
            Yii::$app->session->set('statisticparams', $params);
        }

        $statisticSearchModel = new StatisticSearch();
        $statisticDataProvider = $statisticSearchModel->search($params);

        $authorSearchModel = new StatisticAuthorSearch();
        $authorDataProvider = $authorSearchModel->search([]);

        $promocodeSearchModel = new StatisticPromocodeSearch();
        $promocodeDataProvider = $promocodeSearchModel->search([]);

        $dateFrom = Yii::$app->session->get('dateFrom');
        $dateTo = Yii::$app->session->get('dateTo');

        if (!$dateFrom)
            Yii::$app->session->set('dateFrom', date('Y-m-d'));
        if (!$dateTo)
            Yii::$app->session->set('dateTo', date('Y-m-d'));

        $analytic = Statistic::find()
            ->orderBy(['date' => SORT_ASC])
            ->all();

SELECT * FROM `author`
---
        $authorLabels = [];
        $counts = [];
        $sum = 0;
        $authors = Author::find()->all();

SELECT SUM(count) FROM `statistic_author` WHERE `author_id`=2
---
                $stCount = $stCount->andWhere(['<=', 'date', $dateTo]);

            $stCount = $stCount->sum('count');
            $stSum = StatisticAuthor::find()
                ->where(['author_id' => $author->id]);

SELECT SUM(count) FROM `statistic_promocode` WHERE `promo`='sadf'
---
        $sum = 0;
        $promocodehbc = [];
        foreach ($promos as $promo) {
            $stCount = StatisticPromocode::find()->where(['promo' => $promo->promo]);