backend/modules/admin/views/notification/index.php

                'id',
                'title',
//            'description:ntext',
                [
                    'attribute' => 'user_id',
                    'value' => function (Notification $model) {
                        if ($model->user)
                            return Html::a($model->user->id, ['/admin/user/view', 'id' => $model->user_id]);
                    },
                    'filter' => Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'user_id',
                        'data' => ArrayHelper::map(User::find()->all(), 'id', 'id'),
                        'value' => 'name',
                        'options' => [
                            'class' => 'form-control',
                            'placeholder' => 'Выберите пользователя'
                        ],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'selectOnClose' => true,
                        ]
                    ])
                ],
---
SELECT * FROM `user` WHERE `id`=1
SELECT * FROM `user`