backend/modules/admin/views/layouts/_aside.php

SELECT * FROM `user` WHERE `id`=1
---
                <img src="/dist/img/user2-160x160.jpg" class="img-circle" alt="User Image">
            </div>
            <div class="pull-left info">
                <p><?= User::findOne(['id' => Yii::$app->user->id])->fullname ?></p>