backend/modules/admin/views/layouts/_header.php

                <li class="dropdown user user-menu">
                    <a href="#" data-toggle="dropdown">
                        <img src="/dist/img/user2-160x160.jpg" class="user-image" alt="User Image">
                        <span class="hidden-xs"><?= User::findOne(['id' => Yii::$app->user->id])->fullname ?></span>
---
SELECT * FROM `user` WHERE `id`=1