backend/modules/admin/views/course/index.php

                    'value' => function (Course $model) {
                        return Html::a($model->author->fio, ['/admin/author/view', 'id' => $model->author_id]);
                    },
                    'filter' => Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'author_id',
                        'data' => ArrayHelper::map(Author::find()->all(), 'id', 'fio'),
                        'value' => 'name',
                        'options' => [
                            'class' => 'form-control',
                            'placeholder' => 'Выберите автора'
                        ],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'selectOnClose' => true,
                        ]
                    ])
---
SELECT * FROM `author` WHERE `id`=11
SELECT * FROM `author`

                    'value' => function (Course $model) {
                        return Html::a($model->category->title, ['/admin/category/view', 'id' => $model->category_id]);
                    },
                    'filter' => Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'category_id',
                        'data' => ArrayHelper::map(Category::find()->all(), 'id', 'title'),
                        'value' => 'name',
                        'options' => [
                            'class' => 'form-control',
                            'placeholder' => 'Выберите категорию'
                        ],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'selectOnClose' => true,
                        ]
                    ])
---
SELECT * FROM `category` WHERE `id`=1
SELECT * FROM `category`