common/models/entity/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['email' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`email`='admin@admin.admin') AND (`status`=10)