backend/modules/admin/views/achievement-user/index.php

                    'value' => function (AchievementUser $model) {
                        return Html::a($model->achievement->title, ['/admin/achievement/view', 'id' => $model->achievement_id]);
                    },
                    'filter' => Select2::widget([
                        'model' => $searchModel,
                        'attribute' => 'achievement_id',
                        'data' => ArrayHelper::map(Achievement::find()->all(), 'id', 'title'),
                        'value' => 'name',
                        'options' => [
                            'class' => 'form-control',
                            'placeholder' => 'Выберите достижение'
                        ],
                        'pluginOptions' => [
                            'allowClear' => true,
                            'selectOnClose' => true,
                        ]
                    ])
---
SELECT * FROM `achievement` WHERE `id`=1
SELECT * FROM `achievement`